Revit 2024 API
ContentNode.GetTransform Method
 A transformation matrix associated with the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Transform GetTransform()
Visual Basic
Public Function GetTransform As Transform
Visual C++
public:
Transform^ GetTransform()
See Also
ContentNode Class
Autodesk.Revit.DB Namespace